{"config": [{"config": {"data_format": "channels_last", "dtype": "float32", "cropping": [[65, 25], [0, 0]], "batch_input_shape": [null, 160, 320, 3], "name": "cropping2d_1", "trainable": true}, "class_name": "Cropping2D"}, {"config": {"output_shape": null, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00f4\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "trainable": true, "name": "lambda_1", "arguments": {}}, "class_name": "Lambda"}, {"config": {"strides": [4, 4], "name": "conv2d_1", "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [5, 5], "kernel_regularizer": null, "activation": "linear", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 24, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"alpha": 1.0, "name": "elu_1", "trainable": true}, "class_name": "ELU"}, {"config": {"strides": [2, 2], "name": "conv2d_2", "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [5, 5], "kernel_regularizer": null, "activation": "linear", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 36, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"alpha": 1.0, "name": "elu_2", "trainable": true}, "class_name": "ELU"}, {"config": {"strides": [2, 2], "name": "conv2d_3", "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [5, 5], "kernel_regularizer": null, "activation": "linear", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 48, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"alpha": 1.0, "name": "elu_3", "trainable": true}, "class_name": "ELU"}, {"config": {"strides": [1, 1], "name": "conv2d_4", "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "activation": "linear", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 64, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"alpha": 1.0, "name": "elu_4", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 100, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_5", "trainable": true}, "class_name": "ELU"}, {"config": {"units": 50, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_6", "trainable": true}, "class_name": "ELU"}, {"config": {"units": 10, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_7", "trainable": true}, "class_name": "ELU"}, {"config": {"rate": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"units": 1, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "dense_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential"}